import torch

x = torch.tensor([[1, 2, 3], [4, 5, 6]])
print(x)
y = x.repeat(4, 2)  # 沿着指定维度重复对应维度的元素, 4 在第一维, 表示第一维的元素重复4次
print(y)
z = x.repeat(4, 2, 1)
print(z)
q = x.repeat(1, 1, 1, 2)
print(q)
print(q.shape)
"""
tensor([1, 2, 3])
tensor([[1, 2, 3, 1, 2, 3],
        [1, 2, 3, 1, 2, 3],
        [1, 2, 3, 1, 2, 3],
        [1, 2, 3, 1, 2, 3]])
tensor([[[1, 2, 3],
         [1, 2, 3]],

        [[1, 2, 3],
         [1, 2, 3]],

        [[1, 2, 3],
         [1, 2, 3]],

        [[1, 2, 3],
         [1, 2, 3]]])
tensor([[[[1, 2, 3, 1, 2, 3]]]])
"""